{"podcast_details": {"podcast_title": "Beyond Psychedelics", "episode_title": "Diego Ugalde, CEO of The Trident Approach on Transformation, Integration, and Leadership: Unveiling the Trident Approach", "episode_image": "https://media.redcircle.com/images/2023/6/15/22/80bb0539-80bc-4449-965e-ba60d11efa36_beyondapproved.jpg", "episode_transcript": " All right, everybody. Welcome to another episode of Beyond Psychedelics. Really excited to be here with Diego Gallade, who's founder of the Trident Approach. We met originally at the psychedelic science event in Denver a couple of weeks ago, and really touched me deeply what the man is doing and what the team is up to. They believe that right now there's a time for an evolution needed and leadership and team mindset development. And that's what they do. After speaking with Diego, he shared with me some of the work that he's done, some of the work he's done with veterans. And I knew that there was time for us to have a conversation at large, to share the mission, to support more people that are out there in the world that could use some support. Diego, thank you for your time. Thank you for taking time out of your day to be with us on this conversation. I appreciate you. Same, same, Sebastian. Appreciate you guys. Amazing. So, Diego, fill us in. For anyone that's never heard of the Trident Approach, what is it? How'd you get started with it? So I was a SEAL in the Navy for 15 years. It really surprised a lot of people when I showed up for my first day in the platoon, because my superpower was hugging people. So when I came into the platoon space and hugging all these guys, they're like, hey, what are you doing? You know, so the learning curve was really steep for me because I had to learn all of these, you know, you had already made it through SEAL training and that kind of thing, but you still don't understand the culture of what it is to actually be a SEAL until you're in the platoons themselves. So I had a lot to learn in terms of, you know, getting in the mindset of like winning war. Over time, I did learn those skills. I learned how elite teams operate and communicate and work as a team and all of that stuff. And then in time, I started to notice that, you know, we were getting introduced, you know, time and time again to high level executives and athletes. And they continue to ask the same question was how is it that you work and communicate so well together in the teams? And by that point, I had answers for that, but I also found myself adding things that I knew well that we didn't do in the SEAL teams, which was things like emotional intelligence and compassion for humanity and that type of thing. So when I retired in 2018, I was in one of the coolest spots of my life of, hey, I can do anything in the world. What do I want to do? And that question that I got from executives came up so often. I was like, well, why don't we start a company that addresses that question and we're able to answer it in the way that we want to. Like, here's all the really cool and important things that we did in the SEAL teams. And I feel kind of applied to everyone. And then combining it with emotional intelligence and compassion. And so that's what we did for about a year, bringing it to the psychedelic conversation. About a year later, one of our Pathfinders, he smacked up pretty good with PTS. He's like, hey, Diego, I'm not going to be able to come into work or the next week because there's an organization that takes Navy SEALs down to Mexico and treats them with Ibogaine and 5-MeO for post-traumatic stress, traumatic brain injury, addiction and all that. And I was really surprised because to me, up to that point, I had never heard of psychedelics being used for medicinal purposes. I had always heard them, you know, you do that going to Disneyland, you do that going to music festivals and that kind of thing. But I didn't care. I knew that he was struggling, so I was just happy that he was going to do something about, you know, his current situation at the time. So he came back and he was completely transformed. There was a vibrancy in his eyes we never saw. There was a lightness in his smile that we never saw before. And even his skin color was different. Dude, what happened? What happened to you? And he's like, I have no words. It was just life changing. I got to introduce you to these people. So bringing this story to an end, once he introduced me to those folks and I saw the healing powers of psychedelics, I got involved and I eventually became a psychedelic integration coach. And so I had served with, you know, probably a hundred veterans at that time going through the medicine. And I realized as the Trident approach was existing at the time that executives suffering from, you know, mental block and self-sabotage and all of these things were literally suffering from the exact same things that these veterans are suffering from having experienced all these terrible things that were. Then the Trident approach metamorphosized into what it is today, which is sharing the best of what we learned in the SEAL teams combined with our deepest insights on psychedelic medicine. That's how we help leaders go about getting them to where they want to go. Through this deep integration of just consciousness, raising team development, getting vulnerable. Yeah. A hundred percent, which is a place that not many in our culture are used to going. You know, there's always these, you know, one of the things that psychedelics gave to me is a real honest and honest to the bones assessment of, of, of who I am. Uh, not who I wanted the world to see and not who I was aspiring to be, but who I actually am, which by the way, it was the scariest thing I've ever encountered in my life, even beyond combat and all that stuff. That is a place that we're not taught innately to go. In fact, we're taught to kind of avoid that. And the way I see it is that is actually like the root system of, of all of these things that people are coming to us. Wittingly or unwittingly to address, you know, because that is at the root of confinement, limited thinking, self-sabotage and that whole thing. So that's exactly where we go. If that's where they want to go. Yeah, good. So powerful, man, because you're, you're, you're speaking of, I mean, not being able to be self-expressed and holding things in over the longterm. We know that that causes a big level of, of challenges for somebody. So here you are, you're, you're supporting somebody and diving deep into what they're going through to your point. Large, I think there's a massive paradigm shift going where the idea of before as strength was not crying and everything's all good. And I'm going to put on big armor, but it's, it's quickly shifting. I think that the majority of people are now realizing that true strength is being vulnerable, being open, and then from there, working through things. Now with the Trident approach, because you're focusing on a couple of different things, integration coaching, show with me, that's one of the key things that in the psychedelic space, being the event, that was a big conversation consistently. Integration. There's too many people jumping into treatments without the necessary support ongoingly. What's your perspective on integration and how do you see it being a benefit for somebody going through something like ketamine to be able to actually take in the healing that they could go through with the medicine and treatment. Alan Watts, and I'm going to paraphrase here. Alan Watts has an amazing quote about like hanging up the phone. You know, once the conversation is over, hang up the phone, a scientist doesn't look at the microscope, discover where he discovers and walk around with the rest of his life with that microscope attached to his eyeball. What he does is he puts the microscope away and then he goes back to study and understand what it is that he, he, he came to learn or she came to learn. And what I think a lot of us with this kind of psychedelic renaissance are, are seeing from the outside, these people, they, they go, they have these really powerful experiences with psychedelics. And I go, okay, well, you know, so some people like, I'm okay. I need to do it again tomorrow. Kind of thing. I've known people to do five MVO DMT for days on end, you know, just because it is so powerful and it makes all the sense in the world to me, why they would want to do that, but at the end of the day, the real power of psychedelics to me is that they show you what the potential is. And then it's up to you to do the work that is needed to get to a place of psychedelic lack experience on your own, without the medicine, like as your normal state of being a psychedelic, meaning mind manifesting or a higher state of awareness, you, the goal can be for that to be the case for you absent of the medicine at all. And that is where integration comes from, or really at the end of the day, meditation, a really cool quote. I've been looking for it. I can't find it. Find it one day where there's a Buddhist monk who said, you know, with psychedelics, I can see God with meditation. I am God. So it's psychedelics are really helpful in taking us to where we are in our current cultural awareness and showing us a deeper truth. And that's it. Just showing there's a difference between witnessing truth and being in a state of truth in order to be in a state of truth, you have to do integration work or it will always just be a show. For sure. And I mean, again, back to healing right then and there, there's so many people that know the answers, how many people are actually taking the actions based on what they know much fewer, which what you're pointing to with psychedelics, as you're seeing these, maybe the trauma that took place when you were a child, you now saw it, but now you're not working through it. It's not being worked through. It's going to stay there and they're saying emotions, experiences, anger, frustration, resentment, whatever was there is not going to be actually dissolved because you're still, you still haven't done the work. So I love what you're pointing to, because again, that's true healing, being able to support someone and actually closing a loop that maybe has been open for a long period of time, allowing them to step forward powerfully on that with integration. Have you noticed, are people open to integration? Do you feel like they need to be almost like influence into integration? What's your perspective? That it's the people are people and everyone is completely different. They all have their own experiences. You know, people who are farther along the healing of, of farther along the path of healing seem to be more open to integration and being like almost even capable of doing the work and the people who are, you know, just closer and closer to breaking. Sometimes I get the sense where they just need something to do the work for them. That's I get it. Of course, you know, some people need to be cradled for a while, because maybe they haven't been cradled the entirety of their life, you know, and that's something that we all deserve. So I think it just depends on where people are on the other side of the world, on their healing path, in terms of, of, of what their capacity or potential is for actually putting in the work for integration. And that's, that's another thing that psychedelics have, have, have done a really good job in showing me is, is the, just how critical it is to meet people where they are. I can talk to somebody about integration all day long. If they are just struggling to breathe, they're not any of a shit about all the work that it's going to take. Like they don't want to hear that. And they don't have to hear that. All I can do is just hold space for them. And then one day, ideally they're in a place for like, okay, you know what I mean? I think I at least can get up on my knees right now. Like perfect. That's exactly perfect. Yeah. So just meeting people where they are is really the most important thing. Diego, man, I gotta tell you ever since we started to connect at the event and the follow-up call and now here, I get a deep sense of compassion from you. Your compassion for other people, where they're at and that sense of being able to step into somebody else's shoes and what they're going through and not maybe push someone because it's quote unquote good for them, but allowing somebody to go through their journey so that they can go through their journey. And from there actually be able to work through it. Yeah. Yeah, I think everyone has talents or strengths or whatever you want to call it. I was, I'm really grateful for kind of having that. Even when I was a little kid, I was really compassionate towards other people. In a lot of, and of course I wasn't also, you know, whatever normally being, but when I was compassionate, it always seemed to be something that was really deep for me and meaningful that, Hey, I don't understand what this person is going through and it doesn't matter just where are they and how can I support. And for sure that is absolutely carried on into how we go about doing business. With, with your, with your clients, the people that you're supporting, I know there's a, there's you have a couple of different offerings that you bring to the table. What do you think right now, or what have you seen so far, the marketplace being most interested in, in regards to this integration coaching support? The marketplace as a whole, they don't care about integration. They don't actually care about getting better. They don't, they, they care more about checking the box that, Hey, we've got, we've got a budget for team building. We've got some time. Hey, let's go, let's knock this thing out so we can focus on other things. That's what I see in the majority of the, of the places, because when we start to really have serious conversations, you know, when they talk about where their pain points are and all this stuff, when we're talking about seriously examining those things and helping them come to a deeper awareness so that they're lifting and shifting to where those problems are no longer a problem for them. There's a whole lot of resistance, which is normal. You know, we, I've been talking a lot about already what our culture is kind of aligned to and what our culture is aligned to is in my, to my awareness is very, very shallow surface level, you know, hacks, quick fixes and. Perception over reality. That's what I see in the marketplace. For the people who have come to a place where they finally understand that, that it just doesn't work, it just doesn't do anything. You're just kind of throwing, you know, band-aids on top of these really infected festering wounds that at some point you've got to get in there and start scraping and start cleaning and start, you know, deeply healing that that's where actually change comes from. That's when we get the most excited because that's obviously where we can make the biggest impact. And it's not common. It's not common. You're right, man. I think there's a lot of resistance into your point. I mean, it's uncomfortable. And maybe as a business owner, all of these things that I got to take care of for the business now, I got to bring this emotional side into the picture. It's like, this doesn't make me money. This does. I'm going to focus in on this now, but it's, it's not even just about the money. There's so much more that needs to really encompass a business for it to grow efficiently. How have you seen it once? Uh, go ahead. I see something just come up for you. Yeah. Why it's funny because I think that's the common way of thinking is that there is an, any money in this. And I think that that's where all the money is because when you can get your teams and your organization and your culture completely aligned and going in the same direction, you're aligned on values or principles or mission direction, your intent, everything is going into one place. Like tell me that there is no money there. Tell me that there is an abundance there. Tell me that these people that you hired because of their brilliance aren't being fully allowed to be in their state of brilliance and bringing them full selves, their full selves to the table. Like there's all kinds of money there, but the common understanding is. They don't see it as an investment. They, they see it exactly. Like I don't have time to deal with these emotions, which by the way, human beings are all kinds of emotional, even like the type a guy who just like doesn't say, like there's all kinds of emotion in silence, you know what I mean? So we are hugely emotional beings. And so to ignore that as a CEO, I mean, you're just ignoring it. You're just ignoring the fact that, you know, human beings are actually the ones who are running your organization. So if you're not tending to that, you're not tending to your organization. You read my mind, man. You read my mind. I was literally going to ask, what's the impact that you've seen some of your clients go through and you're pointing to it because you're right. I mean, if I'm, if I'm an employee, I'm a part of a company, I'm burnt out. What, how am I going to show up in my work? What's going to be my output on that compared to if I go through some work that allows me to see something new about myself and the people that I'm working with, maybe I develop a deeper sense of vision and purpose, it's going to completely shift the way in which I show up at work. So yeah, it's super key as a CEO. What would you say to a CEO, somebody that is that's like, they're not closed off, but they're not also taking the initiative on, on supporting their teams in this way. Well, I just bring it to their awareness and leave it to them. It's not up to me to arm wrestle anybody into, you know, thinking this way. It's none of my business. When they're talking to us about our perspective on things, I'm happy to share it and just leave it at that. But, you know, it's like a, it's like a relationship. You don't arm wrestle somebody into loving you either. They're either in a place where they do, or they're in a place where they don't. And the more time you spend doing this, I mean, you're, you know what I mean? Like they're, you're peeling them off of their track in order to be something that you want them to be rather than who, who, or where they are in the moment. So we don't spend a lot of time trying to, you know, reshape how this person is receiving life. We just ask them where they are. And if what we say seems to kind of resonate with them and they're curious, okay, then we can have, then we can start to have like a one level deeper conversation. If they just don't get why it matters to connect with this part of their workforce, the conversation is over, man. You know, I ain't had good luck to you guys, you know, just keep doing what you're doing. Awesome. If by the way, you happen to find yourself here in other six months, two years, three years or whatever, nothing has changed, you know, we're here and that's it. That's just kind of where the conversation ends. You know, it's interesting because I think we're moving as a society at large where, I mean, there's, there's, there's a massive shift happening. I think the paradigm is very clear to see shifting on a business level. We also see that shifting. There's this new sense of consciousness around leadership that and business that is taking a harsh, a large presidents in companies that are growing. I mean, you see just a really silly and not silly example, but small example is Google, how they operate, how they, they don't, people don't have to go to work. People don't have to be there 40 hours a week. No, if they get the work done, they get the work done. They have the pods where they can take some time to breathe, to meditate, to take naps. Like this is literally given by the company as an avenue for their employees or team members to be taken care of. And all this to say, it's just a small example of how in the world of 2023, now with leadership and with business, there needs to be something done differently so that a team member actually feels like they're taken care of, which again, brings it back into the Trout Enterprise. And what you guys are doing in regards to helping people find that level of centeredness, understand who they are showing up as the best version of themselves and everything that they do. I think that's why we have such a good relationship with Google because they, they do see that in us and they see that the value in investing in their people in this way. I could not have been more happier. You know, when I told them, Hey, we're going to, we're going to start this van out today with a breathing exercise, I'm going to be able to do that. Today with a breathing exercise and they were like, okay, you get us. And I was like, Oh my God, somebody who gets us. That's so cool. So it's, it's pioneers, people who understand this kind of stuff that we're really able to make huge differences with. And, and we're always really deeply grateful for those relationships. It's beautiful, man. It's beautiful. And I know you got a couple of other big companies that you work with Google being one of them again, these big organizations. There's, there's something to say as to they're getting into this kind of work for a reason. This is nothing new, by the way, this has been around for a very long time. It's just here in the West world and in the Western paradigm, we're finally grasping and understanding the actual benefits of it. Yeah, for some, for sure. I would say the vast majority are still completely attached to the rat race. Uh, like in the same way I was, um, you know, so it's really just where they are when they, you know, some people never, they pursue the rat race until they die either in their twenties or at the end of a long life. But some people can see some people are given the gift. Like I was given the gift, you know, I, I felt like I had, you know, quote unquote won the rat race and I was still so profoundly empty inside when I, when I was in, you know, standing on top of this mountain, you know, it takes most people six months to make it through SEAL training. It took me like 10 years of failure and breaking bones and not cutting the standards and all this stuff. And I finally, finally made it and then went onto this career and everything. And just coming to the realization that it was still so empty inside just was unbelievably shocking. It wasn't until I turned inward to see, you know, what I was missing, cause I never looked inward in my life. I really hadn't, I didn't even know too, you know, I didn't know who I was. I didn't know all that stuff where things started to make a difference. Had I not, for example, gone on to finally make it through SEAL training, I think, I think living the rat race may well have been my lot in life. I would have just continued, continued, continued and like, man, I would be something if I would have made it through training, you know what I mean? All that. So I was very fortunate enough to, cause there is a lot, I don't care what people say, there is a lot of luck in making it through SEAL training. There's a lot of earning it, but there's also a lot of luck. So I was lucky to make it through and having made it through, I was given the opportunity to look around and, and, and see what it was like to resoundingly triumph and still be empty. So yeah, for the people who recognize that it's never enough with the rat race and they're kind of forced to turn inward. That's when they can start to really make huge differences and, and, and just in their state of being in life. Huge, huge to your point. I found myself in a similar position. I was probably 26 years old at the time selling door to door solar panels. And I was running a team of people, found myself in a beautiful home, really good lifestyle, but completely empty. And a quote that always sticks out with what you're sharing and also I can relate with is success without fulfillment is emptiness. And that's exactly where I was at. I was totally empty because from a successful standpoint, successful, quote unquote, I had it, but there's something else that was definitely missing. And psychedelics did support me as well as life. I mean, life puts us in these challenging experiences, I think, to have us take a step back and explore things differently. There was a conversation happening at the maps event. There was somebody speaking about this, how they did a bunch of research and across a large number of people after they all went through a psychedelic journey. They all said that they had a deeper reverence for life and they were, they had a deeper understanding and respect for themselves internally as to who they were and their relationship to the world around them. So key. So important to remember that again, for us as, as, as humans moving through this times and space, if we're not looking internally, we're going to, if we could easily tiptoe through life and eventually get into our grave, but we're tiptoeing, what would it look like if we actually showed up fully? Again, doing the deep work showing up. Scary within the role to go there. They don't want to do the deep work because it's, it's frightening. But for those who continue to press on, you know, all everything is on the other side, like all of it. Yeah. So, so walk us through a quick, like a day as to what it looks like for the Trident approach with, with team coming in and doing some work with them. Yeah. For the most part, we don't actually do psychedelics with the Trident approach. I mean, they're illegal and all that. So what we've tried to do, uh, is elicit psychedelic psychedelic like responses with our training. And so one of the ways, one of the more common ways we do training is, is, you know, we'll, we'll take people out on the beach and we'll run them through. If somebody was to be on the outside observing what's going on, it looks like we're running them through kind of like sealed training, you know, people are kind of getting wet in Sandy. They're going, you know, they're getting in the water, they're performing races and competitions of things that they can't necessarily accomplish in time. They're doing hard things. And, you know, again, on the surface level, it looks like it could appear like it's just some sort of military training program, but for those who are actually participating in hearing the dialogue, you know, that's going on in the training grounds, we're not doing that just, just to get people to get a good workout, what we are doing is many, many people are not aware of how they're ego manifests in life. There are most people don't really know what the ego is anyway. So what we do is we bring that ego awareness to the top of mind where it can no longer be ignored and for not only the purpose of awareness, but also so that they can start to see themselves maybe for the first time and how they lead, communicate and work as a team under stress, but also to be able to lead, communicate and work as a team under stress. And people have this idea of how they show up in those really stressful times, but it's almost always in contrast to reality. And that can be really hard and heavy people, right? And heavy for people to see that, oh, man, you know, this whole idea of how I am is, isn't so, but the cool thing about our training that I love is that it's a safe place to completely screw everything up. We want people to make mistakes so that they can really get a good understanding of right where they're at. And then towards the end of training, we're actually then able to, we don't, so we're pathfinders, we're not instructors. So we don't tell you what to do. We just help you find your way. And so, for example, so once all the wet and sandy stuff and these races and things are done, we then break them up into smaller teams and they rotate through these stations again, from the outside, they look like really cool, like little Navy seal missions. But each one of these stations is designed to elicit how somebody, how aligned they are with culture, how they build trust, how they communicate and how they work as a team, how they lead. Ego awareness, all of that stuff, connection to the self. That's what these stations are designed to elicit when by putting you under stress, but in a fun way, like their games really. And then as the day goes on, people start getting used to greasing the gears of their mind of how they want to show up under stress. So then when Monday comes around and the Trident approaches and there, and they're under stress, they have experience and showing up the way that's best for them, which again, we have zero input on. It's just, how do you want to be like, where are you at? Cause even that stuff is going to change from time to time. And so we work really hard in ensuring that our egos do not interfere with anybody else's personal development in any way. We're just there to hold space and observe and help and mirror people back to themselves so they can see. So these programs are very emotional. They're very, very powerful. Uh, so powerful in fact, that we used to just have these events that lasted like a day. I'm like, all right, that was awesome. What we're finding out is that people are really ashamed of how they were performing and guess what? That's where the psychedelic experience comes from. And so we recognize that, Hey, we, we need to provide integration. Just like with psychedelics, we need to wrap people up individually. Before we do the training, we do the training. And then after the training is over, we need to coach them individually to help them integrate what they learned on the beach there with us and that day and about themselves so that they can land safely and with power, you know, as opposed to just being like, man, I'm a complete mess. I'm not who I thought I was. Like all of this, you know, you know what the mind can do. You know what the ego can do. So we, we help them just bring awareness to that. And, uh, yeah, I think that's the last thing is I think a huge value that we bring is just helping people improve the relationship that they have with their ego, um, which to me is almost, is almost like you feel like that's awareness is step one and then step two is like, Oh, how do I manage this thing now that I know that it exists in my, as a, as a part of who I am. So good, man. I think that a lot of us are so quick to, and I say us, I generalize you're definitely not in that bandwagon. I also say, I'm not either, but a lot of people, they're, they're, they're very quick to turn away from discomfort. And when they see something challenging, they look the other way, but what you're doing is you're bringing people into that level of, of that comfort zone is being expanded. We just took a, an 18 mile hike on our trip that we just took. And that was one of the most challenging experiences on the way back. The last three miles, you're pointing to that ego coming up, the voices, the chatter and the, oh my God, I'm gonna pass out all these things that are just like bubbling and I can now see how some of that comes up in my day to day. Outside of being on an 18 mile hike, some of that still comes up as I'm sitting on a computer, it doesn't make any rational sense, but the challenges, what I've noticed over my life experiences, the challenges bring about what's underneath and it has, it allows me to see it, which I then can take a new sense of awareness and consciousness in the future when I'm feeling like I'm going to a 18 mile hike, but no, I'm just sitting on a computer, which again, makes no rational sense, but we're humans. We're not rational much more to it than that. So I don't see the ego is like this big negative monster. I see it as like the great teacher. And the way it chooses to teach is by, you know, just dropping these irrational bombs in our head of like, you're not going to be able to make it. You're not going to do this so that you can learn that that's not true, that you can make it and it's just trying to build the muscles within. And like, for example, I have two brothers, one older and one younger. They both died from drinking. And I think the reason why that happened was because they had this ego chatter going on inside of their minds that they bought into as a part of, hey, it's coming from my mind. So it is me. I'm thinking this, so it must be so. So they continued to escape and, and, and try to fulfill with, with all this alcohol and stuff and, and, and the ego is just sitting there just being like, yep, here's not a lesson. Here's not a lesson. And they're like, here's another drink. Here's another drink. So it has the ability to drive you into the ground. If you never learn, or there's also a possibility for someone to say, wait a second, like there's something up here. What is going on and start to dig and develop. And then, and then the person who's able to do that is able to start to take the first steps necessary in order to gain sovereignty over the self sovereignty over the minds, you know, just let a thank you very much to you. I appreciate what you're doing. But no, this is what we're going to do instead. That's when you start to really live very powerfully, but it all starts with awareness. We don't even know that there's a component within you that's doing that. You just, you know, you're, you're just at the, at the winds of the currents of the winds of the day. Sure. Man, Diego, such a powerful conversation. And there's, this is just like, I feel like we're just scratching the surface on how deep we could go. I thank you for taking the time to break down the, the, the, the breakdown, some of this, everything that you've done for the training approach, the way in which you're supposed, you're supporting people in going through the journeys, I'm sorry to hear about your two brothers passing away and I get the sense of power around it. You got, you saw something for yourself from that, that you're now being able to bring forward into the world. And again, that's ultimately what true leadership is in my perspective, to be able to support some other people from our own journey and you're doing that. So I appreciate you very much. What's the best location place way of communicating with you for anybody listening? Just go to the Trident approach.com. And there's a bunch of several tabs in there of connecting with us. We're on Instagram. We're starting to build those platforms up now. It was never really a social media person, but now we have these awesome interns from the university of Georgia. They're, they're really helping us step up our game. So they're also putting in mechanisms on those platforms to make it easier for people to reach out to us, whether they want coaching for their teams or, or individuals or keynotes, uh, speakers, or they want to come out and actually get their hands dirty and leadership and see, see where they are by doing one of our events. So, and then our book is coming out and all that stuff. So they're making it really easy for people to find us now. So we're really grateful for them. Amazing. Amazing. So easiest way, the Trident approach.com you can, the website is full of information by the way. So if you're checking it out, you can even find some of the podcasts that Diego you've been on a lot of good stuff in there. Diego, thank you again, my friend. Appreciate you so much. Appreciate you brother. Talk to you soon. Talk to you. The opinions expressed on this cannabis radio.com program are those of the guests and hosts and do not necessarily reflect those of the staff and management of cannabis radio.com. Any rebroadcast, republication or retransmission of this program without proper consent is prohibited."}, "podcast_summary": "On this episode of Beyond Psychedelics, host Sebastian is joined by Diego Gallade, founder of the Trident Approach. Diego shares his journey from being a Navy SEAL to starting the Trident Approach, a company focused on leadership and team mindset development. He also discusses the integration of psychedelic medicine into their approach and the profound transformations he has witnessed in both veterans and corporate executives. The conversation highlights the importance of ego awareness and the need for deep self-reflection and growth. Tags: psychedelic industry, leadership development, team mindset, veterans, psychedelic integration, ego awareness.", "podcast_guest": null, "podcast_highlights": "🍄 Highlight 1: Trident Approach Origins\nDiego Gallade explains how his experience as a Navy SEAL led him to create the Trident Approach, a company that focuses on leadership and team mindset development. He shares how his unconventional approach of combining SEAL team skills with emotional intelligence and compassion has helped high-level executives and athletes improve their performance and communication. (Timestamp: 2:21-7:04)\n\n🍄 Highlight 2: Integration and Psychedelic Medicine\nDiego discusses the importance of integration after psychedelic experiences. He compares using psychedelics to a microscope that allows individuals to witness a deeper truth, but stresses the need for integration to manifest that truth in everyday life. Diegos also shares how psychedelics can support personal growth, emotional healing, and expanding consciousness. (Timestamp: 12:49-19:43)\n\n🍄 Highlight 3: The Power of Ego Awareness\nDiego emphasizes the significance of ego awareness in personal and professional development. He believes that the ego is not a negative force, but rather a great teacher that provides valuable lessons through irrational thoughts and challenges. By developing sovereignty over the self and learning to navigate the ego, individuals can live more powerfully and authentically. (Timestamp: 32:29-38:44)"}