{"podcast_details": {"podcast_title": "Luminous: A Podcast about Psychedelics from To The Best Of Our Knowledge", "episode_title": "Luminous: What happens to an octopus on MDMA?", "episode_image": "https://feeds.podcastmirror.com/~images/2002781684359122.png", "episode_transcript": " Hey, it's Steve Paulson and this is Luminous, a podcast series about psychedelics from To the Best of Our Knowledge. When I ask friends if they've taken psychedelics, I hear the same kind of thing all the time. They'll say, yeah, back in the day, you know, in college or at a rave or hanging out with friends, it was like a rite of passage when they were young. But you could argue the people who would benefit the most from these mind-bending experiences are people my age, middle-aged or older, because psychedelics have a unique capacity to open up the mind so that everything feels fresh and full of possibilities. Especially as you get older, it's so easy to get stuck in a rut. But under a psychedelic, the brain can become more plastic. This time period, though, is limited. It might just last a few days or a few weeks. So it's really important to understand this critical period when our minds are so open and also so vulnerable. These critical periods are what Gule Dolan has been studying for years. She's a neuroscientist at Johns Hopkins with both a PhD and an MD, and she's done some groundbreaking studies on the critical periods of psychedelics, including studies with octopuses. Yeah, she's given MDMA to octopuses. She's also challenging a lot of the scientific work that's been done on psychedelics. She has serious doubts about the value of neuroimaging or even a concept like the default mode network. So if you heard our last luminous episode on the neuroscience of psychedelics, you'll want to listen to this interview. I reached Gule Dolan in Oakland, California, and we took a deep dive into the neuroscience of critical periods. I have to say, I also got a really good sense of how an innovative scientist thinks. So hope you enjoy the conversation. How did you first get interested in psychedelics? Well, I think probably similar to a lot of neuroscientists, the first time I got interested was when I saw the serotonin molecule, a picture sitting right next to a picture of the LSD molecule. At the time I was in college and I had designed my own major called comparative perspectives on the mind. And it occurred to me that this similarity between the serotonin molecule and the LSD molecule really held the key for understanding consciousness. I saw that and I thought, well, geez, this really means that everything that we think of as consciousness or our ability to perceive the world really comes down to molecules. And that was overwhelming for me and I really haven't let go of my amazement at that ever since. So you've spent a lot of time focusing in particular on MDMA, the psychedelic that's probably best known as the party drug ecstasy or MOLLE. So why the interest in this in particular? Yeah, so my interest in pro-social behavior, social behaviors really actually also goes back to those early college days where I was trying to understand philosophical concepts like theory of mind and the relationship for that being able to understand the world from another person's perspective. And then years later when I started my own lab, we discovered a novel critical period for social behavior and I'll explain what critical periods are in a second. I had the idea that, well, maybe we can use MDMA, which is sort of unique amongst psychedelics for having these pro-social properties. I could use that to try and understand what are the mechanisms underlying this critical period and can we use this drug to reopen them? Just to follow up on sort of the difference between MDMA and other psychedelics like psilocybin or LSD, MDMA induces more social behavior than the others? That's right. And we think that some of that is because MDMA is able to induce, it reverses the activity of the serotonin transporters. So it acts at the same binding site as a Prozac or any of these SSRI type of selective serotonin reuptake inhibitors, they're binding to that transporter, the same one that MDMA is binding to. But when they bind to it, they just block it. So it makes more serotonin available in the synapse by blocking it's being vacuumed up by this transporter. What MDMA does is it binds to that transporter and actually reverses the direction of it. So instead of vacuuming up serotonin, now it's extruding serotonin in massive quantities into the synapse. And when that happens, it seems to trigger the release of oxytocin, which is another neurotransmitter that has been heavily implicated in social behaviors. And so when we first started working on MDMA, that's what we thought the story was. We thought it was all about serotonin and oxytocin and that we could account for all of its therapeutic actions, all of its ability to reopen this critical period was all based on that mechanism. But more recently, the work that we just published really says that that idea was maybe wrong. You have done a lot of the pioneering work on this idea of a critical period, especially after a psychedelic experience. Can you explain what this is and why it's so important? Yeah. So neuroscientists, independent of psychedelics, have been obsessed with the idea of critical periods for almost 100 years. Ever since they were discovered in 1935, three Nobel prizes have been given. Neuroscientists want to figure out about critical periods. And these are these windows of time when the brain is especially sensitive to something in the environment that's relevant for that particular type of behavior that the brain is trying to learn about and can form sort of long lasting memories around that stimulus, whatever it is. The classic ones are things like imprinting behavior in birds or language learning in humans. But also critical periods are used during brain development to organize the visual system, the touch system, the hearing system, motor learning. And my lab basically discovered a new critical period, which is the critical period for social reward learning. And just to follow up on that, I mean, most of these critical periods are especially when people are young, right? I mean, from infancy and then into adolescence and maybe early adulthood. And then we tend to have fewer critical periods after that, right? As we get older. So the critical period is closed, essentially, as you get older. By the time you reach teenage, late teenage, early adulthood, most of them are closed. And so you can reopen them by various ways. So like after you have a big stroke, the motor learning critical period will reopen for about three months and it will enable you to kind of learn a little bit from your environment again and recover some function. But whatever physical therapy you get in that first three months, that's it. After that closes again, you're back to not being able to recover any more motor function. And so the therapeutic implication here is that if you have an injury later in life, if you have an injury or impairment when you were young and you didn't fix it before you got to the closure of that critical period, then you're kind of stuck. You're not really going to be able to recover much function afterwards. And this is why neuroscientists have been so obsessed with this topic, because we've had this insight that the reason why we're so terrible at curing psychiatric diseases, neurological diseases, why most people stay impaired forever when it's a brain disease is because critical periods close. So if you fix the underlying problem, it might not help at all if the relevant critical period isn't reopened. So we've been looking for a way to reopen them. And of course, psychedelics are sort of known specifically because they seem to reopen something in our minds. They do something with the brain that makes us more receptive for at least a brief period of time. Well, I love how you say that, that's common knowledge, like everybody agrees on that, because actually we discovered that and it was just published last week. So I'm glad that it's already widely accepted that that's what psychedelics do. So maybe not using the phrase critical period, but the sense that it opens up the mind. I mean, isn't that sort of the assumption of psychedelics? I guess I sort of thought that that was common knowledge, but I guess not. No. In fact, when I tell people about this critical period result, people are like, oh yeah, that jives with my intuitive sense of feeling like when I take a psychedelic, I return to this sort of childlike state of wonder and amazement and curiosity about the world. I feel open to the world in a way that I haven't for years, not since childhood. People intuitively like the idea, but just to give you a sense of how radical this is, when I was a graduate student at MIT, we had kind of an ongoing debate with another lab at Harvard and the Harvard lab was really pushing the idea that there could be a master key for unlocking critical periods. And I was very much of the opinion that no way, anything that could be a master key for unlocking critical periods would be really bad for the brain. It would either cause amnesia or it would cause seizure or it would cause the brain to just structurally fall apart, like what I call the melty brain problem. And so I think what is cool, interesting about psychedelics is that we have evidence, we haven't proven it yet. We basically only looked at the one critical period that my lab discovered, but if they really are this master key for unlocking critical periods, then somehow they have solved the melty brain problem. And I think the way that psychedelics, I mean, it's my hypothesis, we haven't proven this yet either, is that the way that psychedelics circumvent the melty brain problem is because their effects are context dependent. So therapeutically, we know that you can't just take psychedelics and go to a rave and expect that you're going to have your PTSD cured. Plenty of people take psychedelics and keep doing drugs like nicotine or whatever, addictive drugs. It's not a cure unless you're giving it in the right context. And so my working model of how this is happening, how psychedelics are able to be this master key, but not cause all these problems in the brain is because they're only sort of activating the synapses or the neural circuits that are used for encoding a specific memory. And only those recently activated context dependent, you know, coincidence detection, all of these mechanisms that we know in neuroscience for normal learning and memory, only those recently active neurons and circuits and synapses become available for modification for this critical period reopening. And so my lab is currently working on trying to figure out how the neurons, how the circuits know that they are the ones that should be available for critical period reopening without touching all the rest of them. So you've just said that your lab has made this discovery, you've just published the results. Can you explain what you found? You know, my first big discovery around social reward was that this type of social behavior is encoded by oxytocin plasticity, and that was our 2013 Nature paper. And then when I started my own lab, we discovered that MDMA can reopen this social critical period by triggering some of these oxytocin mechanisms. And that was the one that we published in 2019. And at the time, we really thought that, okay, this is because MDMA is social, we're trying to open a social critical period. And that's why it's working because of this this unique property that it has that other psychedelics don't have. So in this paper that we just published, what we discovered is, is that actually, it doesn't matter whether it's a social psychedelic or not, all of the psychedelics reopen this critical period. It doesn't matter. LSD is not particularly social. Ibogaine is not particularly social. Ketamine is not particularly social, and yet they all do it. I mean, that's a huge finding, what you just said. I mean, this is just enormous that all of these psychedelics have this property. Yeah. And I mean, we were amazed by it. And I was just kind of like, that can't, I don't understand this. This doesn't make any sense. We also noticed, and this is to me is maybe even more surprising. We know that psychedelics are different from each other, not just in the flavor of their acute subjective effects, but also in the duration of those acute subjective effects. We know that ketamine lasts about 30 minutes to two hours in people, whereas psilocybin and MDMA are a little bit longer, three to five hours. LSD is a little bit longer than that, eight hours. And ibogaine is kind of the rock star of the group, the acute subjective effects last anywhere from 36 to 72 hours, right? So really, really long lasting effects. And we knew from the literature that there also seemed to be sort of a rough correlation between the duration of these acute subjective effects and the therapeutic durability. So ketamine, for example, it's not terribly durable in its effects, it's rapid, but after about a week, depression symptoms come back and you have to take more ketamine. Whereas the remarkable thing about ibogaine is there have been these reports that people take ibogaine and have a big experience and they stay off of heroin for a year afterwards. So incredibly durable, especially for a really entrenched memory like heroin addiction. That's remarkable, right? And so we wanted to know, is there some relationship between the duration of these acute subjective effects and the duration of the critical period open state that the psychedelic drugs are able to induce? And there was, and this is remarkable because whereas ketamine sort of keeps it open for about three or four days, LSD keeps it open for three weeks, ibogaine keeps it open for at least four weeks, as long as we've looked. And what this means is a couple of things that are really important. One is it's more evidence that the shared property that we see across all psychedelics is critical period reopening. And it suggests that what it feels like to be in that altered state of consciousness that's common to all of them is just what it feels like to be open in critical periods. So that's another piece of evidence for that. The other major importance of that result is that it tells us that there's a reason that clinicians have spent so much time focusing on the integration period right after the acute effects of the drugs have worn off and that that integration period seems to be really important for solidifying the changes that are happening during these therapy sessions. If people are staying in this sort of vulnerable open state for two to three weeks after we give them the drug, A, it's a missed opportunity if we don't continue to give them more therapy and more support during that. But also it could be potentially dangerous if we're not taking care of people when they're in that vulnerable state. Can I just, you've put a whole bunch of stuff on the table here. So I want to come back to the potential harm later, but just to sort of unpack this. So obviously the implications of what you found are profound because what you're talking about is the brain has this opening during the psychedelic experience and then for just a relatively brief time afterwards. And it's absolutely crucial to figure out what to do with that experience, whether it's a day or three weeks or something like that. That's the period, that's the moment, that's the critical period when real change, when transformation can happen. That's right. That's right. You can think of it in two different ways. You can think of it like after you have, let's say open heart surgery to clear a blocked artery. During the two weeks after you've had that open heart surgery, especially if you had a heart attack first, the walls of the heart are very, very mushy, if you will. They're very fragile. And so it's easy to get another injury if you don't rest appropriately during that. So that's the sort of negative side of it. Like the brain is going to be in this extremely vulnerable state where you're going to be taking in information sort of like a child does. And just like we have protections for children, we don't let them watch violent movies. We protect them against things that will cause them too much fear, too much trauma. We protect them. Similarly, we want to protect people when they're in that vulnerable state. But on the other hand, it's also the time where we can do the most transformation and we can really lock in those insights like, oh, it turns out I was smoking cigarettes because I hate myself and I thought that this is all I deserved or whatever the narrative that you've built around smoking is, this is the time to really solidify the new patterns of thinking to say, oh, actually, I am worthy and I don't need to smoke anymore. Right. So this is a shift away from the way that we've approached addiction, for example. I think the model of addiction that neuroscientists have been following and trying to develop drugs around for so long is drugs cause addiction because they cause dopamine release. And all we have to do to reverse addiction is to change the reward value of those drugs of abuse. And what this is saying is, no, no, actually, there's a whole narrative that we build around our addictions and that cognitive reappraisal that psychedelics are enabling to sort of rewrite the narrative around why we are smoking those cigarettes is a much more powerful way of reversing addiction because it's sort of like people are taking psychedelics, having this big epiphany and then smoking cigarettes seems as silly as leaving out cookies and hoping a fat man's going to bring you presents. Right. Like it's a reappraisal. And once you've seen the myth behind that smoking cigarettes is silly. Right. And so I think this explanation of critical period reopening really jives well with those kinds of patient narratives when they talk about what happened and why they quit smoking or whatever drug. My guest is Gule Dolan, a neuroscientist at Johns Hopkins. In a minute, we'll talk about her remarkable experiments with octopuses. She gave MDMA to these famously antisocial creatures. You're listening to Luminous, our podcast series about the science and philosophy of psychedelics. The story that has often been told about psychedelics over the last decade or so is that during a psychedelic experience, the default mode network is kind of knocked out. The executive function, the cognitive function recedes and sort of you get access to this other part of the brain. How does what you're saying about critical periods map on to that idea of knocking out or reducing the default mode network? I'm going to say not at all. I'm going to say that the two ideas are completely separate. And I have to say, you know, I think the default mode network explanation got a lot of attention in the beginning. But just so we understand each other, if you look up in sort of a scientific literature search default mode network and almost anything else, there will be at least a couple of papers supposing that the default mode network is important for ego. Default mode network is important for the opposite of ego, social. The default mode network is important for memory. The default mode network is important for believing in aliens, whatever. It's just, it's a very widely invoked idea because the brain regions that are part of that network are association areas that are doing complicated things and putting together, you know, not just information from the visual system, but also from the memory systems, the executive command centers. And you know, we do a lot of different executive functions besides just social, besides just ego, besides all of these things. Are you saying we should just get rid of the whole idea that psychedelics knocks out the default mode network? That's just sort of a not useful way of talking about psychedelic experiences? I find it to be a useful metaphor. I, you know, as somebody, as somebody who studies synapses and circuits and learning and memory, these kinds of fMRI imaging studies, they're a little bit like trying to understand a traffic problem in New York City by taking pictures of cloud cover from Saturn, right? Like, it's like, yes, there is a correlation probably between a cloudy rainy day in New York and traffic. But if you really want to understand what causes traffic, it's probably better to look at, you know, traffic lights and little old ladies with walkers trying to get across the street and car accidents and all of those kinds of details. And so the type of analysis we do is really more like that granular stuff. So this is a really important point here. A lot of the original neuroscience work on psychedelics was using brain imaging, especially fMRI, measuring blood flow in the brain to, you know, different parts of the brain. You're saying that's not terribly useful. That's not very revealing. And so you're doing something very different. Yeah, I mean, I don't want to blow off the entire field of neuroimaging, but I think that different types of approaches are going to necessarily give you different kinds of answers. And just to nail it down what the problem is with pointing to a brain region and saying, oh, well, this lights up when we give psychedelics. Now we understand that this brain region or this set of brain regions is responsible for the psychedelic experience. I think the main problem with that is revealed by the octopus studies that we did. Right. It's an organism that doesn't have a default mode network. It doesn't have, you know, a nucleus accumbens, which is the brain region we study. It doesn't have a hypothalamus. It doesn't have an amygdala. It doesn't have any of those brain regions. And yet when you give them MDMA, it produces the same pro-social behaviors as when you give it to a human or a mouse. Right. So what that's telling us is that those anatomical sorts of explanations are just sort of an accident of evolutionary history. And they're not really the core mechanism. The core mechanism is coming down to something at the level of there is a serotonin transporter in an octopus brain that is expressed in brain regions, XYZ, that don't even exist in a mammal. Right. And it's able to sense the MDMA and that serotonin's function as an encoder of sociality is so old that even though our last common ancestor with an octopus was like 650 million years ago, right, like we are more closely related to a starfish than we are to an octopus. Right. And yet all you need to do this remarkable MDMA, pro-social psychedelic thing is that same binding site, which comes down to the molecular level. So just to back up for a moment, it's worth noting you gave MDMA to octopuses and a particular species of octopus that is known to be anti-social, right? Yeah. Yeah. So I mean, most octopuses of the 300 or so known species of octopus, they're almost all of them are asocial. There is one social species called the larger Pacific striped octopus, but we haven't done any studies with that species. We're working on its sister species, which is also asocial. But the paper that you're referring to, the one that we published in Current Biology in 2018, I believe, that was the California two-spot octopus, octopus bimaculoides, and they are definitely asocial. Like when we started those experiments, we made sure to keep them in separate chambers under flower pots because we knew that if they had access to each other, they would probably kill each other. And so they're very aggressively asocial. And so it was a little bit of a surprise, I'll admit, that when we gave them MDMA, they ceased to be asocial and they were spending all their time in the social chamber. And this tells us a couple of important things. One, it says that the brain circuitry for sociality exists in these octopuses, but that it's normally suppressed outside of the reproductive window, right? So normally it's turned off. It also suggests that for whatever reason, octopuses evolved to be asocial because it was adaptive for whatever hunting strategy or lifestyle strategy that they decided to do or that was imposed on them by evolution. But that given that all other cephalopods are social compared to octopuses, there's something unique about the strategy that octopuses have chosen where being asocial is so adaptive. Well, and it's also striking. I mean, octopuses, of course, are famous for being so smart. And yet they're like the really smart cephalopods, and yet they are probably the most asocial of the cephalopods. Yeah. I mean, this is why I love octopuses. You know, like we have all kinds of rules that we come up with as biologists, as philosophers about like, oh, social cognition is such a complex behavior. Only really, really smart animals can do social cognition. Or you know, most animals that are really smart live a long time. Or if you have a cortex, you need lots of layers of cortex, then you get to be really smart. And octopus just blows all of those rules out the window. You know, they don't have a cortex. They don't live that long. They're not social, and yet they're smart and able to solve problems. And so the way I think of them is really, they're the psychopaths of the ocean, just to be cheeky about it. Because you know, they have the ability to manipulate their environment with incredible locomotor dexterity. And I think that this probably enables them to do things like theory of mind-like behavior, because they can really start to understand that their viewpoint is different from the viewpoint of other animals in the environment. And this is very similar, actually, to people with antisocial personality disorder, psychopaths, you know, these theory of mind-like games. I know that you know that I know that you know. This requires this ability to put yourself in the position of somebody else. And so psychopaths, you know, are often very clever, and they use this ability to great advantage. And so the assumption has always been that theory of mind evolved by the selection pressures of social living. But the octopus is telling us that actually, maybe it's older than that. And maybe it really is about hunting behaviors, because they use it really to hunt shrimp and trick their prey into jumping into their arms and eating them, right? And so it's a different selection pressure that's encoding that. Yeah. Now I want to just ask briefly also about the other animal species that you've been doing a lot of these studies on. That's mice. So you are giving mice MDMA too? How do you know how mice are responding? I mean, if they're having a psychedelic trip or that. Right. So I mean, I think this is the real reason why most of the early studies in sort of the recent past for psychedelics have been focused on humans, because there's this idea out there that, you know, really psychedelics are doing something so wondrous and so cool that only a human can really see God and have these mystical experiences and therefore, if we really want to understand the cool part of psychedelics, we have to look in humans. And basically, every single time a philosopher or a neuroscientist says, this is something that only humans do, within a couple of years, somebody discovers an animal that can do it as well. And so this anthropocentrism that we have around language, about theory of mind, about psychedelics, our studies are also kind of challenging that view as well. And mice are a good example of why we should not be so anthropocentric in the way that we think about these problems, because we tend to think of mice as like not being that smart. And part of the reason is, is because they're not top predators the way that we are. I often joke, they're sort of the potato chips of the animal kingdom. Everybody eats them, right? And so, you know, their response to a threat is going to be very different from ours or from an octopus. They sort of hunker down and they're what some people call obligate stoics. They don't display their fear and aggression because it's not adaptive for them to do that. And so we have a hard time recognizing their intelligence in some ways, because it's so different from the way that we, what's adaptive for us to express intelligence. So what happens when you've given MDMA to a mouse? I mean, how do you know that they're tripping? Yeah, so we actually decided to just circumvent that problem altogether, right? So we're not studying the acute effects of the drugs, right? So we're giving the drugs MDMA or LSD or Ibogaine or psilocybin or ketamine, and then we're waiting for 48 hours. So the acute effects have worn off. And what we're measuring is just this critical period reopening using a behavioral assay that measures their ability to learn from their social environment. So we kind of jumped over the whole problem of are they really tripping or not, right? But we do know from other studies, there's good evidence that when animals, when mice are on ketamine, when they're on psilocybin or similar drugs that activate the same receptors, that they do have changes in their visual perception, hallucinations, auditory hallucinations, that mice do have them. And there are a variety of different assays that people have developed to measure those things. We just skipped over that completely. So what are you looking for? How do you measure then the duration of the critical period in a mouse with these different psychedelics? What are the changes in behavior? Basically, when an animal is young, when they're sort of a teenage mouse, if you will, they are able to form a lasting association between a bedding they associate with social versus a bedding they associate with being alone. But as the animals get older, that stimulus no longer causes that learned association like the bedding I associate with social is good, right? And that's different, for example, than cocaine, right? If we test cocaine, you know, adult animals will learn an association between cocaine and a bedding just as well as a juvenile like everybody loves cocaine no matter what age you're at. But social, you know, that learned association goes away. But if we pre treat them with a psychedelic, then they're able to learn that association just like they were when they were juveniles. Yeah. So what is actually happening in the brain during these critical periods when the brain is kind of opening? I mean, is the brain getting rewired? What's happening? Basically, in critical period literature, just in general, there are three main mechanisms that people have discovered that sort of constrain critical period learning to this this window of time. And the three main ones are remodeling of the extracellular matrix, metaplasticity, and changes in EI balance, inhibitory excitatory balance or maturation of inhibition. Those are the three main. OK, you're going to have to explain that because I don't know what any of those things mean. All right. So EI balance is sort of the one that I think got a lot of traction because people were originally studying critical periods in the cortex where there are inhibitory neurons and excitatory neurons. And as the brain matures, the ability of the brain to fire those excitatory neurons gets tamped down because the inhibitory networks get built up and it really kind of quiets things down. And that's why adults are much less likely to have seizures than kids are. It's just a sort of maturation of the brain. The other one, metaplasticity, this is a change in the ability to induce synaptic plasticity. So a baby, an MDA receptor is much more likely to induce the kind of changes in the cell that enable plasticity to happen compared to an adult and MDA receptor. It's just a molecular program that as the brain matures, the composition of the receptors changes and makes it harder to induce plasticity as you get older. And then the last thing is extracellular matrix. My friends who study extracellular matrix are going to kill me for making this analogy, but you can sort of think of it as the grout between the tiles. Right. It's the thing that sets down the structural integrity around the synapses once the memories are formed, once they are sort of locked into place. And you want some memories to get locked into place. You don't want to constantly be always learning things because you want to be able to remember what your grandmother's face looks like really all the way through the rest of your life. And so this maturation or this locking in of the extracellular matrix is thought to be the sort of last step in closing the critical periods. And so what we have discovered is that psychedelics seem to bring back metaplasticity and dissolve the extracellular matrix, making those synapses malleable again. So getting rid of the grout so that the synapses can change again. You said earlier that you think neuroimaging has relatively little value when trying to understand what's really happening in the brain during psychedelic experiences. So what's your method? How are you diving deep into, you know, really looking at what's happening in the brain? What we use for the metaplasticity experiments, we use whole cell patch clamp electrophysiology. So what we're doing is we're taking a teeny tiny glass electrode and mashing it onto the side of a neuron. And then we're poking a tiny, tiny hole in that neuron so that we can record the electrical activity directly from the individual neuron. You're talking about single neurons you're doing this with. Single neurons. That's right. Single neurons. This is a very difficult technique and it takes years to learn how to do it. It's hard to do it in an intact animal. So you have to cut brain slices and keep them alive. But you know, it's possible and we can do that. So we have like single neuron resolution. And just to give you a sense of like how different that is from fMRI, you know, a single voxel on an fMRI, you're looking at like at a minimum 50,000, 100,000 neurons, right? And it's not even the neurons themselves. It's the blood flow that's supposed to tell you about whether or not those neurons are active. And just so you understand, like in that sort of voxel space, there could be inhibitory neurons. There could be excitatory neurons. There could be modulatory neurons. And what you're measuring is the net effect of all of those things. So changes in opposite directions could give you a net zero, even if, you know, there's a lot going on. You just wouldn't be able to measure it using fMRI. So I'm not saying that it's irrelevant and I don't mean to dismiss all of fMRI imaging, but because we think that the explanation for how psychedelics work has to come down at some point to here's a chemical binding to this receptor and then a bunch of stuff has to happen. It's a good idea to be able to look at that interaction between the receptor and the molecule. This is Luminous, a podcast series about psychedelics from To the Best of Our Knowledge. I'm Steve Paulson talking with Gull Dolan, the neuroscientist who studies the critical periods when our brains are especially receptive to psychedelics. So what about the phenomenology of psychedelic experiences? I mean, you know, this experience that's totally different than the way it feels in ordinary waking reality. Can neuroscience explain what that's all about? I mean, you're sort of talking about the causes that can lead to that, but the actual experience itself. Is that a neuroscience question to try to unpack that? I mean, if you had asked me five years ago, I would have said, not in my lifetime. I mean, that's a fun thing to debate when you're in college, but it's just not something that's really going to happen in my lifetime. But I got to say this insight about critical period reopening for me feels like now we have a mechanistic handle to start asking those kinds of questions because there are other similarities. So we know, for example, that people on psychedelics often report mystical experiences that feel very religious to them. Like they've had an epiphany. They are similar to the mystical experiences that people report when they have, you know, they go on meditations, they lie down in a cave for a month. They have these all these- Have a near death experience, yeah. A near death experience, give birth, fall in love can be a mystical experience, right? And so we have all of these similarities. And yet, what's the commonality? Well, it turns out that one of the other ways that people have traditionally reopened critical periods is by doing deprivation experiments, right? So visual deprivation can reopen a visual critical period. We have some evidence, we're still working on publishing this paper, but we have some evidence that social deprivation can reopen the social critical period. I think the stroke results are telling us that motor deprivation can reopen a motor critical period. And so why do religious practices that do this, do it? Well, the Buddhists, the Zen Buddhists talk about getting back to beginner's mind. If you were looking for a neurobiological explanation of beginner's mind, reopening critical periods would be it. So now we have a mechanism that is shared between the mystical experiences reported by these deprivation techniques and religious practices and psychedelics. And to me, that's the closest we've gotten to being able to say, okay, this is what it feels like to be in that altered state of consciousness. And how many of those other things, those mystical experiences that we have are actually just feel mystical because it's another way of reopening critical periods. But I'm still trying to figure out the parallel with deprivation then that you have in certain religious practices. Are you saying that a psychedelic experience, there's some component of deprivation there? No, I guess it comes back to what I think that why we have critical periods, why they close and why there are mechanisms available for reopening them. So we have critical periods because there's just not enough space in the genome to encode every kind of behavior that we might want to learn. There's not enough space in the genome to encode 200 different languages, which you might be exposed to. So you have to encode the ability to learn that language. And then depending on what environment you grow up in, you learn Japanese or English or Turkish or whatever. So that's why they exist. They close because they're energetically, emotionally expensive. Habits get a bad rap, but this habit formation is useful. We navigate our worlds much more efficiently once the critical periods close and we're just going on rote. But this is only useful assuming that your environment is stable. But imagine that there's a radical shift in your environment. Your whole mouse colony gets eaten by a wolf or you move to a new country and nobody speaks the language that you grew up speaking. Then this radical shift in the environment, we think, is a way, a signal to the brain to say reopen, you need to learn your environment again. It's not stable. And so I think that what deprivation techniques are doing is they're signaling to the brain radical shift in the environment reopen and that psychedelics are doing the same thing. They are telling the brain something's different. The world is not what you expect. And that triggers this set of cascaded cellular events that reopens the critical period. So I want to come back to this question of the potential damage that can happen during a critical period. I mean, we've been focusing on the wonderful positive effects, especially in psychedelic therapy, dealing with depression or addiction and how there's this moment, this opening when it seems like people can deal with that and actually change. We also know that the military is very interested in psychedelics. Cult leaders have used them. It seems to control other people and people are in a very vulnerable state during these critical periods. What are the risks here? Yeah, having this insight that what's happening is that you're reopening critical periods does I think explain the cult leader phenomenon. It really does help to explain why Charles Manson was able to convince a bunch of hippies to go on a murdering rampage after believing that he was Jesus Christ or whatever he indoctrinated them with. Was he giving his disciples LSD? I can't remember what it was. I believe he was giving them daily LSD and more and more indoctrinating them into, this is the family, you belong to the family, you should get rid of all of your inhibitions and everything that we're doing is for the ultimate benefit of humanity. We're going to helter skelter, disrupt everything. This is a case of a bad context. You take the psychedelics and you expose yourself to a bad context. Similarly, I think if we don't take enough care in the way that we are implementing psychedelics and therapeutic practices, if we go for the pill that you can just give people and they can go home and medicalizes them for life because all you're doing is treating symptoms. My worry is actually that if we try and engineer out the psychedelic experience and we reduce this window of time that the critical period stays open, then we're going to take away this ability to cure people for life. It's going to interfere with that. I think that the opportunity is also the risk. We don't want to be giving people psychedelics and sending them back to their lives that they might be exposed to trauma again. If we're going to be using this to retrain police and trying to get them to be more empathetic to the communities that they're policing, we don't want to give them psychedelics and then go and put them in a traumatic situation where they're going to fear for their lives. It's just going to make things worse. We don't want to put abuse victims back in with their abusers. These are all of the risks that we really need to be careful about. I think that this is really the importance of trying to understand the mechanism is it helps us to ameliorate potential risks based on that understanding. One final question, what do you think the big questions are still that neuroscience might be able to explain about psychedelics? What don't we know yet and what do we still need to figure out? Well, I can tell you the two main areas that my lab is pursuing with this, we want to try and figure out the mechanisms of this context dependence. I think this is going to be hugely important for figuring out the next generation of medicines and also that's going to be the trick of how to implement these. It's related to the second big area that we are focused on, which is if it's true that these are the master keys and all you need to do to open, say, a social critical period is a social context, but if you want to open a motor critical period, you just need to take the psychedelics in a motor context or a visual context or a new language context. What that suggests is that we should be able to treat diseases like stroke. We should be able to go back to somebody who had a stroke 10 years ago, reopen that critical period and then give them the right kind of physical therapy that enables them to recover function. Just so I understand this, you're saying that maybe use a psychedelic for treating stroke victims? Yeah. Wow. We are working on that actively. We're raising money for the phase one safety trial. We're raising money for the phase two efficacy trial. It really moves us outside of just neuropsychiatric disease and says any brain disorder and stroke is a big one. 400,000 people a year in the United States alone have a debilitating stroke that they don't recover motor function from, that they actually end up needing long-term care for. That's every single year. That's a huge number of people, not to mention all of the people who are having traumatic brain injuries from sports, from car accidents. All of these types of diseases, we think all we have to do to get improved therapeutic efficacy is to pair the right physical therapy with the psychedelics. This project, we're calling it the Fathom Project, which it's Fathom with a P-H. It stands for psychedelic healing, adjunct therapy, harnessing open malleability. We have a whole bunch of them that we are raising money for. Fathom stroke, Fathom traumatic brain injury, Fathom... I can imagine it for people who've had cochlear implants who didn't get full language recovery. It really expands out the possibilities. Our ability to test those ideas is really just going to come down to who's going to give us the millions of dollars that we need to do those studies. This has been fascinating, absolutely fascinating. Thank you so much. Thank you so much. I've really enjoyed it. Nice to meet you. That's Gould Dolan, the neuroscientist at Johns Hopkins who's done pioneering work on the critical periods of psychedelic experiences. You're listening to Luminous, our series about psychedelics from To the Best of Our Knowledge. You'll find more interviews on the science and philosophy of psychedelics on our website at ttbook.org slash luminous. I hope you're subscribing to the podcast feed. In upcoming episodes, we'll be exploring some really complicated questions like can plant medicines be decolonized? Do you need a mystical experience to have a transformative psychedelic experience? Also, Chris Beige tells the story of his 73 high dose LSD journeys where he ends up wondering is it possible to have too much transcendence? To the Best of Our Knowledge is produced in Madison, Wisconsin. Joe Hartke is our technical director. Sarah Hopeful did the sound design for this episode. Mark Rickers is our digital producer. I'm Steve Paulson. Thanks for listening. PRX."}, "podcast_summary": "In this episode of the Luminous podcast, neuroscientist Gule Dolan discusses the neuroscience of critical periods in relation to psychedelics. She explains how psychedelics have a unique capacity to open up the mind and increase plasticity, allowing for new perspectives and possibilities. Dolan's groundbreaking studies on critical periods and her work with octopuses demonstrate the potential of psychedelics in therapy. The podcast also challenges popular theories, such as the default mode network, and highlights the importance of understanding and supporting individuals in the vulnerable and open state that follows a psychedelic experience. #psychedelics #neuroscience #criticalperiods #therapy #plasticity", "podcast_guest": null, "podcast_highlights": "Highlight 1: Critical Periods (00:58 - 13:45)\n\nNeuroscientist Gule Dolan discusses the concept of critical periods, which are windows of time when the brain is especially sensitive to learning and memory formation. Dolan explains that psychedelics have the ability to reopen these critical periods and allow for new patterns of thinking and behavior to form. This insight challenges the belief that critical periods are only relevant in childhood and suggests that psychedelics may have therapeutic potential for adults.\n\nHighlight 2: Mechanisms of Critical Period Reopening (25:14 - 36:44)\n\nDolan explores the mechanisms by which psychedelics reopen critical periods. She describes three main processes involved: remodeling of the extracellular matrix, metaplasticity (changes in synaptic plasticity induction), and changes in inhibitory-excitatory balance. By studying these mechanisms, researchers can gain a better understanding of how psychedelics impact the brain and facilitate transformative experiences.\n\nHighlight 3: Risks and Benefits of Psychedelic Use (47:20 - 55:01)\n\nDolan discusses the potential risks and benefits of using psychedelics during critical periods. While psychedelics have shown promise in treating mental health conditions and facilitating personal growth, Dolan emphasizes the importance of providing individuals with a safe and supportive context during their psychedelic experiences. She also expresses concerns about the medicalization of psychedelics and the need for further research to mitigate risks and optimize therapeutic outcomes."}