{"podcast_details": {"podcast_title": "Shroomed - Mushroom Podcast | Breaking the Stigma around Mushrooms and Psychedelics Mushroom Culture", "episode_title": "Shroomed - Episode 7 - Bill Wilson Alcoholics Anonymous preached LSD and Mushrooms! Shroom, NA, AA", "episode_image": "https://d3t3ozftmdmh3i.cloudfront.net/production/podcast_uploaded_nologo/15824699/15824699-1675025248171-31ffb5b2f24de.jpg", "episode_transcript": " Stay shroomed 24 7 visit shroomed.com for the best in shrooms Stay shrooms 24 7 Is it shroomed.com for the best in shrooms Hello everyone and welcome to The shroomed podcast the podcast about how to integrate magic mushrooms and psychedelics into your everyday life Today I want to try something a little bit different and just read an article That is one of my favorites. It's from lucid dot news by Don Latin. It's called Bill Wilson LSD and the secret psychedelic history of alcoholics anonymous That was one of my topics with Dave from the Doby podcast last year About how Bill Wilson was a LSD Proponent for helping stop alcohol and other things but was quickly shut down But yeah, and also just want to let you guys know today is November 9th 2022 a little bit rainy out here where I'm at But I'm feeling good micro dose this morning took my reishi turkey tail lion's mane and cordyceps And after micro dosing here with that and also psilocybin I've had some questions, you know about what to do with shroomed how I should go out marketing and You know, I'll tell you the last few days have been a little bit more clear for me And you know it usually it's it's hard for me to find ideas and be creative and in the last few days have been Pretty exceptional. So Uh, that's that's been good. It's been good. So you guys should see more of shroomed via social media via twitter via My podcast so i'm very excited But like I said, let's go ahead and get into today's episode And i'm going to read this passage So bill wilson lsd and the secret psychedelic history of alcoholics anonymous written by don latin October 20th 2022 October 20th 2022 i'm sorry 2020 Taking one mind-altering drug to free oneself from addiction to another mind-altering drug may sound counter-intuitive But like with all psych all things psychedelic This therapeutic approach is all about set and setting intention and integration What kind of drugs are consumed how often and what dose? Those who preach that the only way to achieve lasting sobriety is through total abstinence from alcohol And other drugs may be surprised to learn that the supposed patron saint of abstinence bill wilson The co-founder of alcoholics anonymous was a firm believer In the ability of lsd to free some hardcore alcoholics from their addiction Bill wilson's enthusiasm for lsd as a tool in 12 step work is best expressed in his correspondence In 1961 with the famous swiss psychologist carl jung Jung was discussing how he agreed with wilson that some diehard alcoholics must have a spiritual awakening to overcome their addiction He pointed out that the latin word for alcohol is spiritus You use the same word for the highest religious experience jung wrote as for the most depraved Depraving poison as for the most depraving poison That letter of january 30th 1961 in response to a long letter wilson wrote to jung Is fairly famous in a circles but in researching my book distilled spirits getting high Then sober with the famous writer a forgotten philosopher and a hopeless drunk I discovered a second wilson letter to jung in that letter of march 29th 1961 Wilson writes at length about his experience using lsd To help members of the alcoholics anonymous Community have the spiritual awakening that is central to the 12 step program of recovery Some of my a.a friends and I have taken the material lsd frequently and with much benefit wilson told jung Adding that the most powerful psychedelic drug sparks a great broadening and deepening and heightening of consciousness Wilson told jung that his first lsd trip in 1956 reminded him of a mystical revelation he had After hitting bottom in the 1930s and winding up in a new york city hospital ward for hardcore alcoholics My original spontaneous spiritual experience of 25 years before was enacted with wonderful splendor And conviction he wrote Lsd was still legal in 1956 and wilson Wilson case initially taken under the medical supervision of ucla researcher sydney cohen and with the spiritual guidance of his wilson's friend jerald herd an anglo irish mystic and early proponent of psychedelic spirituality Wilson would go on to quietly form a bicoastal psychedelic salon with various leading lights of that decide including the writer adis hicks huxley Wilson's earlier spiritual experience Occurred of december of 1934 before lsd was even invented it happened during wilson's fourth and final stay at a private new york city hospital that employed something called the town's lambert cure to treat their alcohol clients Many of these patients including wilson were once successful businessmen Whose drinking had spun out of control during the great depression? Suddenly bill would later recall my room blazed with an indescribably white light. I was seized with an Ecstasy beyond description that room was in a rehab center where doctors employed a potion which was included Two drugs derived from plants known to cause delirium and hallucinations one of them is bella donna and the other henbane Was long associated with witchcraft and potion said to summon spirits of the dead Warning to psychonauts both of these plants can be poisonous at high doses do not try at home So there's a good chance that psychoactive plants play their role in the So there's a good chance that psychoactive plants play their role in what came to be known as the founding vision of alcoholics anonymous Even though the effects of the herbs used at town's hospital differ from the other psychedelic plants and from the lsd would Wilson would begin experimenting with two decades later Here's how bill wilson would later describe this town's vision In the mind's eye there was a mountain I stood upon its summit where a great wind blew a wind not of air but of spirit In great clean strength it blew right through me then came the blazing thought you are a free man In my view it doesn't really matter if bill's vision was caused by psychoactive plants divine revelation or the hallucinations hallucinations hardcore drunks sometimes experience when they hit rock bottom and stop drinking What matters is the vision? that That the vision transformed his life and inspired a crusade to free other alcoholics from addiction one of the foundations of the 12-step recovery program Wilson and the company devised in 1930s is Is the proposition that alcoholics and other addicts must undergo a spiritual awakening? Inspiring them to turn our will and our lives over to the care of god as we understand him Those are the only words in the 12-step program That were printed in italics indicating an openness in the early a circles to finding god and the judio-christian tradition eastern spirituality or 20 years later In a tab of acid in fact long before he discovered psychedelics Wilson was a serious student of paranormal psychologically psychology psychology and various forms of spiritualism Holding seances and other gatherings with some of the leading psychics of his time In his second letter to jung bill wilson told jung that many members of a have returned to the churches almost always with fine results But some of us have taken less orthodox approaches Along with the number of friends. I find myself among the latter Wilson cited the canadian research of humphrey osmond the man who turned huxley onto mescaline in the 1953 osmond reported that 150 hardcore alcoholics were Pre-conditioned by lsd and then placed in the surrounding a a groups Over a three-year period they achieved startling results when compared to similar drunks who were not treated with psychedelics But only got a a my friends Believe that lsd temporarily triggers a change in blood chemistry that inhibits or reduces ego So thereby enabling more reality to be felt and seen Wilson told jung jung became seriously ill around the time. He received wilson's second letter. He never answered that Missive and he May have not even gotten a chance to read it before he died jung died on june 6 1961 bill wilson died 10 years later from diseases caused by The other addiction he could never shake cigarettes In the end not much came of bill wilson's idea to introduce lsd to alcoholics anonymous more cautious conservative elements in the a a fellowship push back questioning their founders Unbridled enthusiasm for the drug in one letter wilson Asserted that the powerful psychoactive compound was about as harmless as aspirin But in another piece of correspondence he acknowledged that lsd does not have any miraculous property of transforming spirituality And emotionally sick people into healthy ones overnight wilson also wrote That those opposing lsd enthusiasm in a a were joking that bill takes one pill to see god And other to quiet his nerves meanwhile by the mid 1960s the notorious lsd and vajalism Of such counterculture icons as harvard professor timothy leary and mary mary prankster Ken cassie had begun turning mainstream america against the ideas of psycho psychedelic therapy In recent decades psychologists and neuroscientists have researched substance abuse Research that began in the 1950s In recent decades psychologists and neuroscientists have resurrected substance abuse Research that began in 1950s and was shut down during the war on drugs in the 70s and 80s clinical trials trials have once again shown effectiveness of using psychoactive drugs psychedelic drugs Along with psychotherapy to treat addiction to alcohol cocaine and tobacco Alcohol cocaine and tobacco again. I want to read this in recent decades Psychologists and neuroscientists have resurrected substance substance abuse research that began in the 1950s And was shut down during the war on drugs in the 1970s and 80s Clinical trials have once again shown the effectiveness of using psychedelic drugs Along with psychotherapy to treat addiction to alcohol cocaine and tobacco at the same time there has been an explosion of interest in the ritualized use of ayahuasca ibogaine and Other plant medicines to help those addicted to various drugs of abuse in my book changing our minds psychedelic sacraments and the new Psychotherapy, I interviewed addicts alcoholics therapists shamans and scientists doing their work Carol carlson an alcoholic treated in the clerical trial at the university of new mexico said A vision she had of jesus during the psilocybin assisted therapy enabled her to forgive Myself for the choices she had made Gordon mcglockland a lifelong smoker approaching retirement kicked his tobacco Habit following a psychedelic clinical trial at john hopkins university in baltimore Asked how his trip did the trick he said you suddenly understand how your body and the universe are connected I might want to have a cigarette, but you know, I don't need it Carson a heroin addict I interviewed at a treatment center in mexico and asked that his name not be used in uh Uh treated was treated with two psychedelic medicines ibogaine and five meo dmt Carson a 31 year old Evangelistic christian from dallas said he felt reborn after the experience since the ibogaine He told me the basic craving that i've had for opiates is gone for the the first time in 10 years If this all sounds too good to be true That's because sometimes it is another heroin addict I interviewed for my book at the same clinic quickly relapsed after his miracle cure He soon realized that he needed an ongoing support group and other lifestyle changes if he wanted to stay Uh clean from addictive drugs and thoughts and behaviors. That's exactly the point behind emerging network of alcoholics and other addicts who have Slightly rewritten bill wilson's 12-step programs and hold zoom meetings under the banner psychedelics in recovery As a recovering alcoholic and cocaine addict I played a minor role in the formation of that online fellowship. I got sober in 2000 this is Dominic milton Not me, so as a recovering alcoholic Don played A minor role in formation of the online fellowship. He got sober in 2006 and did so without psychedelics he tells that story in distilled spirits in 2014 after eight years of taking nothing stronger than a double espresso he started researching And reporting changing our minds over the next few years as a part of a project It looks like he revived his own psychedelic experiment as a observer He explored therapeutic spiritual use of magic mushrooms mdma ketamine ayahuasca and dmt so far He has not touched alcohol or cocaine nor has he fallen the Abuse of psychedelics. He still drinks too much espresso So I want to share a little bit of my story behind this too because this is fascinating um, you know I feel like You know after drinking heavily heavily for two years. Um, you know, the meetings were not working out for me when I tried Um, it just wasn't my thing and I feel like it's not a lot of people's thing and I don't want to knock alcoholics anonymous Because it is such a strong group and a strong community, but there is Um a community out there that needs psychedelics Where these meetings do not work not everything works for everyone and I want everyone to understand that um, you know and vice versa psychedelics may not work for somebody But I do want to stress the fact that you know, I got sober with psychedelics like you know, I I now see this as a poison like I now I I Think twice before You know taking a drink, you know, it's And I feel like psychedelics if you have intentions when you're taking the psychedelics and and really, you know Really want to you know be gone with that. It really does help. It's really powerful Um, it's really changed my mind in many ways. Um, obviously like I said, there's still things I need to work on but You know with this alcohol it was probably my biggest the biggest thing Um, and I just want to you know, not let bill wilson's, you know thoughts and research go um, you know We don't want them to go anywhere because we there this is helping a lot of people and it's still helping a lot of people um, so You know, i'm not knocking a a but I am telling you, you know if it's not working for you. There are other things that you should try Um, you know reach out, you know info at shroom.com. I can definitely help and talk to you more about what what I did Um, you know where you can get safe access to medicine But you know don't give up. Um You know, it's just crazy. You know how much this has helped many people and it's and it's just being pushed under the rug um But with the right treatment the right record microdose schedule, I really think this can really You know be powerful So yeah, um shoot over to shroom.com. Thank you guys for listening. Hope everyone has a great day"}, "podcast_summary": "In this podcast episode, the host reads an article about Bill Wilson, the co-founder of Alcoholics Anonymous, and his belief in the potential of LSD to help alcoholics overcome addiction. The article explores Wilson's correspondence with Swiss psychologist Carl Jung and his own experiences with LSD. It also discusses the role of psychedelic drugs in addiction treatment and the resurgence of research in this field. The episode emphasizes that while Alcoholics Anonymous may work for some, there is a community that finds psychedelics to be a powerful tool in their recovery journey. Possible tags for this podcast episode: psychedelic therapy, addiction treatment, LSD, Alcoholics Anonymous.", "podcast_guest": null, "podcast_highlights": "🍄 Highlight 1: Bill Wilson's LSD Enthusiasm - 2:08\n\nBill Wilson, the co-founder of Alcoholics Anonymous, was a firm believer in the ability of LSD to help hardcore alcoholics overcome their addiction. Wilson corresponded with Swiss psychologist Carl Jung about the role of LSD in spiritual awakening and its potential in the recovery process.\n\n🍄 Highlight 2: Resurgence of Psychedelic Research - 14:01\n\nIn recent decades, there has been a revival of psychedelic research, particularly in using psychedelics alongside psychotherapy to treat addiction to alcohol, cocaine, and tobacco. Clinical trials have demonstrated the effectiveness of this approach, and interest in the ritualized use of psychedelics like ayahuasca and ibogaine for addiction treatment has grown.\n\n🍄 Highlight 3: Psychedelics in Recovery - 20:01\n\nA network of individuals has emerged, rewriting Bill Wilson's 12-step program and holding Zoom meetings under the banner of \"Psychedelics in Recovery.\" These individuals have found that traditional meetings may not work for everyone and have incorporated psychedelics as a tool in their recovery journey, emphasizing the importance of intentions, safe access to medicine, and ongoing support."}